       IDENTIFICATION DIVISION.
       PROGRAM-ID. MATCH-RECORDS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE1 ASSIGN TO "file1.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT FILE2 ASSIGN TO "file2.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT FILE3 ASSIGN TO "file3.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD  FILE1.
       01  FILE1-RECORD.
           05 FILE1-DATA   PIC X(12).
           05 FILE1-KEY    PIC X(8).
           05 FILE1-REST   PIC X(60).

       FD  FILE2.
       01  FILE2-RECORD.
           05 FILE2-DATA1  PIC X(20).
           05 FILE2-KEY    PIC X(8).
           05 FILE2-REST   PIC X(52).

       FD  FILE3.
       01  FILE3-RECORD   PIC X(80).

       WORKING-STORAGE SECTION.
       01  FILE1-END-OF-FILE    PIC X VALUE 'N'.
       01  FILE2-END-OF-FILE    PIC X VALUE 'N'.

       01  FILE1-WORK-KEY       PIC X(8).
       01  FILE2-WORK-KEY       PIC X(8).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN INPUT FILE1
                INPUT FILE2
                OUTPUT FILE3.

           PERFORM READ-FILE1.
           PERFORM READ-FILE2.

           PERFORM MATCH-RECORDS
               UNTIL FILE1-END-OF-FILE = 'Y' OR FILE2-END-OF-FILE = 'Y'.

           CLOSE FILE1 FILE2 FILE3.
           STOP RUN.

       READ-FILE1.
           READ FILE1 INTO FILE1-RECORD
               AT END MOVE 'Y' TO FILE1-END-OF-FILE
               NOT AT END MOVE FILE1-KEY TO FILE1-WORK-KEY.

       READ-FILE2.
           READ FILE2 INTO FILE2-RECORD
               AT END MOVE 'Y' TO FILE2-END-OF-FILE
               NOT AT END MOVE FILE2-KEY TO FILE2-WORK-KEY.

       MATCH-RECORDS.
           IF FILE1-WORK-KEY = FILE2-WORK-KEY THEN
               MOVE FILE1-RECORD TO FILE3-RECORD
               WRITE FILE3-RECORD
               PERFORM READ-FILE1
               PERFORM READ-FILE2
           ELSE
               IF FILE1-WORK-KEY < FILE2-WORK-KEY THEN
                   PERFORM READ-FILE1
               ELSE
                   PERFORM READ-FILE2.
